src/cf/src/InformationRegisters/ИсторияСобытийЗадач/ИсторияСобытийЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияСобытийЗадач</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ВидыСобытийЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыСобытийЗадач/ВидыСобытийЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытийЗадач</name>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ИзмененаВажность</name>
  </enumValues>
  <enumValues>
    <name>ИзмененСрок</name>
  </enumValues>
  <enumValues>
    <name>ОткрытаКарточка</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
  </enumValues>
  <enumValues>
    <name>Перенаправлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ПринятиеКИсполнениюОтменено</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОтветИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ИзмененПроцентЗавершения</name>
  </enumValues>
  <enumValues>
    <name>ДополнениеОписания</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ОценкаВыполнения</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоПоЭлектроннойПочте</name>
  </enumValues>
  <enumValues>
    <name>ИзмененоСостояниеДругое</name>
  </enumValues>
  <enumValues>
    <name>ИзмененПолучательУслуг</name>
  </enumValues>
  <enumValues>
    <name>ИзмененВидЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоПоТелеграм</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/CommonModules/ИсторияСобытийЗадачВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьСобытие(Задача, Событие, Комментарий = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ИсторияСобытийЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗаписатьСобытиеОткрытаКарточка(Задача) Экспорт
	
	ЗаписатьСобытие(Задача, Перечисления.ВидыСобытийЗадач.ОткрытаКарточка);
	
КонецПроцедуры

#КонецОбласти
